#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.this: Refreshing state... [id=862f74fb15500f339e93ad23da95ba9a5a553751]
local_file.cloud_pem: Refreshing state... [id=0e456aaf02e792fc5c712f411881f4191acebb25]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cd38112092baf927]
module.key_pair.aws_key_pair.this[0]: Refreshing state... [id=test]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023359d7cc7d68417]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-04605cf5436ef5f2b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-042e9a0f2623bc8dc]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0023601f22181ef37]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-086eccf56685e69fc]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d298b4fed68f244e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-065353468516f98a4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04531fbfe94596c82]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03d35c71b78d91847]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-010df001fe7c9cdc1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-012fc94ef89a5e129]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fbc42d0ba2f37902]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f1d3bd404491c023]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d7f4eb3f5aec425a]
module.ec2_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-08d521124aac6c2fd]
module.ssh_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0310ff5b57d86a8c8]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023359d7cc7d684171080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b0e7639b806e4a58]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04504342bd385f9a7]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d3adc74c04289fd3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02b9571cea3017dd7]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0578d3de0de551d96]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-001ad1c8b4b32252a]
module.ec2_sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-4109159301]
module.ec2_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-745001700]
module.ec2_sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-139027130]
module.ec2_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3870400889]
module.ssh_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1269737753]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-0aab56825624e9f8a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # local_file.cloud_pem has been deleted
  - resource "local_file" "cloud_pem" {
      - content              = (sensitive) -> null
      - content_base64sha256 = "C0x1NhjIue10RHXmKbrEyKzsO0WOCPyfiWOvCOvqwnk=" -> null
      - content_base64sha512 = "hbzAsQmSRKJdw2QrA3H9SfzSFPq9Yvn/IPbL1bX/D/e/NS9m8n1yhZmCZuKQLN5tzdDULUF+p9HoFkgvSa3VVw==" -> null
      - content_md5          = "d90bbb8c5609f1452ffabf7d5275f898" -> null
      - content_sha1         = "0e456aaf02e792fc5c712f411881f4191acebb25" -> null
      - content_sha256       = "0b4c753618c8b9ed744475e629bac4c8acec3b458e08fc9f8963af08ebeac279" -> null
      - content_sha512       = "85bcc0b1099244a25dc3642b0371fd49fcd214fabd62f9ff20f6cbd5b5ff0ff7bf352f66f27d7285998266e2902cde6dcdd0d42d417ea7d1e816482f49add557" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./cloudtls.pem" -> null
      - id                   = "0e456aaf02e792fc5c712f411881f4191acebb25" -> null
    }

  # module.ec2_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-08d521124aac6c2fd"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All IPV4 ICMP"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "ec2_sg-20230510135343664300000001"
        tags                   = {
            "Name" = "ec2_sg"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ec2_sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-3870400889"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.key_pair.aws_key_pair.this[0] has changed
  ~ resource "aws_key_pair" "this" {
        id          = "test"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }

  # module.ssh_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-0310ff5b57d86a8c8"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "ssh_sg-20230510135346715600000002"
        tags                   = {
            "Name" = "ssh_sg"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ssh_sg.aws_security_group_rule.ingress_rules[0] has been deleted
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks            = [
          - "52.74.146.55/32",
        ] -> null
      - description            = "SSH" -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-1269737753" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0310ff5b57d86a8c8" -> null
      - security_group_rule_id = "sgr-068e1bc06d7d1c6e1" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "ingress" -> null
    }

  # module.vpc.aws_default_network_acl.this[0] has changed
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-065353468516f98a4"
        tags                   = {
            "Environment" = "dev"
            "Name"        = "my-vpc-default"
            "Terraform"   = "true"
        }
        # (6 unchanged attributes hidden)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + icmp_code       = 0
          + icmp_type       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      - egress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + icmp_code  = 0
          + icmp_type  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + icmp_code       = 0
          + icmp_type       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      - ingress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + icmp_code  = 0
          + icmp_type  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }
    }

  # module.vpc.aws_default_route_table.default[0] has changed
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-03d35c71b78d91847"
      + propagating_vgws       = []
        tags                   = {
            "Environment" = "dev"
            "Name"        = "my-vpc-default"
            "Terraform"   = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-023359d7cc7d68417"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0d298b4fed68f244e"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "my-vpc-public"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.cloud_pem will be created
  + resource "local_file" "cloud_pem" {
      + content              = (sensitive)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./cloudtls.pem"
      + id                   = (known after apply)
    }

  # module.ssh_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "52.74.146.55/32",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-0310ff5b57d86a8c8"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @thienchuong, Action: `pull_request`, Workflow: `Terraform check`*